Trying the mermaid charts
